/**科技效果 */
export enum ScienceEftType {

    SCIENCE_1001 = 1001,    //所有单体类佣兵对场景建筑造成的伤害提升							
    SCIENCE_1002 = 1002,	//所有单体类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_1003 = 1003,	//所有单体类佣兵1级时，造成的伤害提升							
    SCIENCE_1005 = 1005,	//佣兵娜塔莎射击敌人时暴击概率提升							
    SCIENCE_1004 = 1004,	//所有单体类佣兵对生命值低于20%的怪物造成伤害提升							
    SCIENCE_1006 = 1006,	//佣兵杰克升级到3级后，可使周围所有种类佣兵射击速度提升							
    SCIENCE_1007 = 1007,	//所有单体类佣兵对BOSS类怪物造成伤害提升			
    
    SCIENCE_2001 = 2001,	//所有范围类佣兵对小型怪物伤害增加							
    SCIENCE_2002 = 2002,    //所有范围类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_2003 = 2003,    //所有范围类佣兵升到3级后，伤害提升							
    SCIENCE_2005 = 2005,    //佣兵吉格斯的炸弹对所有伤害目标造成额外灼烧伤害							
    SCIENCE_2004 = 2004,    //所有范围类佣兵对生命值高于80%的怪物造成伤害提升							
    SCIENCE_2006 = 2006,	//佣兵莱斯莉升级到3级后，可使周围所有种类佣兵伤害提升							
    SCIENCE_2007 = 2007,	//所有范围类佣兵造成的溅射伤害提高	

    SCIENCE_3001 = 3001,    //所有减速类佣兵减速效果提升							
    SCIENCE_3002 = 3002,    //所有减速类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_3003 = 3003,    //所有减速类佣兵攻击范围提升							
    SCIENCE_3005 = 3005,    //佣兵廖击中敌人时，有概率使地面结冰，通过结冰区域的怪物会被减速50%		 (------)					
    SCIENCE_3004 = 3004,	//所有减速类佣兵攻击速度提升							
    SCIENCE_3006 = 3006,    //佣兵小雪将敌人冰冻的时间增加							
    SCIENCE_3007 = 3007,	//所有减速类佣兵造成的减速时间增加		
    
    SCIENCE_4001 = 4001,    //所有多重类佣兵伤害提升							
    SCIENCE_4002 = 4002,    //所有多重类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_4003 = 4003,    //所有多重类佣兵对生命值低于20%的怪物造成伤害提升							
    SCIENCE_4005 = 4005,    //佣兵基德攻击时，有五分之一概率抽出一张鬼牌，鬼牌造成伤害提升	(-----鬼牌------)						
    SCIENCE_4004 = 4004,    //所有直线类佣兵升到3级后，伤害提升							
    SCIENCE_4006 = 4006,    //佣兵哈娜在攻击四个敌方目标时，造成的伤害提升							
    SCIENCE_4007 = 4007,    //所有多重类佣兵只攻击单个敌人（包含场景）时，伤害提升							
					
    SCIENCE_5001 = 5001,    //所有剧毒类佣兵对大型怪物伤害增加							
    SCIENCE_5002 = 5002,    //所有剧毒类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_5003 = 5003,    //所有剧毒类佣兵毒素伤害每回合衰减的毒素降低						
    SCIENCE_5005 = 5005,    //佣兵弗兰科击中敌人时，有概率使地面被污染，通过污染区域的怪物会感染剧毒	(-------)					
    SCIENCE_5004 = 5004,    //所有剧毒类佣兵攻击距离提升							
    SCIENCE_5006 = 5006,    //佣兵瑟西击中怪物后，会使怪物收到诅咒，被诅咒的怪物3秒内受到伤害提升							
    SCIENCE_5007 = 5007,    //所有剧毒类佣兵使敌人毒发的时间缩短	
    						
    SCIENCE_6001 = 6001,    //所有穿透类佣兵对场景建筑造成的伤害提升								
    SCIENCE_6002 = 6002,    //所有穿透类佣兵雇佣和升级消耗的金币降低					
    SCIENCE_6003 = 6003,    //所有穿透类佣兵攻击速度提升							
    SCIENCE_6005 = 6005,    //佣兵奇犽攻击后，回旋镖飞行一段距离后返回，对沿途目标造成伤害		(回旋镖)					
    SCIENCE_6004 = 6004,    //所有穿透类佣兵对生命值高于80%的怪物造成伤害提升							
    SCIENCE_6006 = 6006,    //佣兵悟空每施放6次冲击波后，第7次会施放超级冲击波，造成伤害提升	(冲击波)						
    SCIENCE_6007 = 6007,    //所有穿透类佣兵在攻击时，每穿透一个怪物，伤害就会提升	
    
    SCIENCE_7001 = 7001,    //所有收益类佣兵攻击敌人时，有一定概率获得双倍的金币							
    SCIENCE_7002 = 7002,    //所有收益类佣兵雇佣和升级消耗的金币降低							
    SCIENCE_7003 = 7003,    //所有收益类佣兵1级时，造成的伤害提升							
    SCIENCE_7005 = 7005,    //佣兵索菲亚升级到3级后，可使周围所有种类佣兵攻击范围提升							
    SCIENCE_7004 = 7004,    //所有收益类佣兵将一定比例的伤害转化为攻击速度							
    SCIENCE_7006 = 7006,    //佣兵皮咻攻击怪物时，获取的金币数量增加							
    SCIENCE_7007 = 7007,    //所有收益类佣兵杀死怪物（包含场景建筑）后，获得的金币提升	

}